jekyll/_posts/Perl/2013-01-02-mojolicious-study-note-2.html
---
layout: tech-post
title: Mojolicious 学习笔记
category: Perl
change_frequency: monthly
tag: Mojolicious
---




<p>
<b>Mojolicous</b> : <a href="http://mojolicio.us/">http://mojolicio.us/</a>
</p>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Mojolicous结构</h3>
<div class="outline-text-3" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1">route 路由</h4>
<div class="outline-text-4" id="text-1-1">

<p>   根据request进行路由，可以根据：url,param,format,method等进行路由
</p></div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2">controller</h4>
<div class="outline-text-4" id="text-1-2">

<p>   路由的目的地是controller中的某个action，由此action来处理。一个controller一个perl模块，包含多个action作为subrutine。  
   controller是Mojolicious::Controller的子类。  
   默认的controller是Mojolicious::Controller,通过$app-&gt;controller_class('PeSystem::Controller') 设定$app的默认controller.  
   controller获得app: <b>$self-&gt;app</b>
   controller获得请求: <b>$self-&gt;req</b>
   controller获得路由匹配的参数: <b>$self-&gt;stash('id')</b>
   controller的一些helpers:Mojolicious::Plugin::Defaulthelps，它包含dumper,stash,url_encode等方法方便使用(<b>$self-&gt;stash('a'=&gt;'b')</b>)
</p></div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3">action</h4>
<div class="outline-text-4" id="text-1-3">

<p>   action是controller内的子过程。操作都是在action内进行的.  
   渲染页面: <b>$self-&gt;render('&hellip;'),$self-&gt;render_exception,$self-&gt;redirect_to(&hellip;),$self-&gt;render</b>,如果controller没有显式渲染，controller返回后页面会被自动渲染。
</p></div>

</div>

<div id="outline-container-1-4" class="outline-4">
<h4 id="sec-1-4">template</h4>
<div class="outline-text-4" id="text-1-4">

<p>  模版，根据format的不通会自动选择不通的模版:$namespace/$controller/$action.$format.ep, ep结尾表示mojo的内置模版类型（可以嵌入perl）  
  异常模版: exception.$mode.$format.ep,exception.$format.ep, $mode为mojo运行的模式（如production,development）
  404模版:not_found.$mode.$format.ep,not_found.$format.ep
</p></div>

</div>

<div id="outline-container-1-5" class="outline-4">
<h4 id="sec-1-5">异常</h4>
<div class="outline-text-4" id="text-1-5">

<p>  Mojo::Exception 是其异常类  
  Mojo是通过local $SIG{__DIE__}来注册自己的异常捕获的。  
  主动抛出异常用die "string",用Mojo::Exception-&gt;throw('string')不会携带上下文信息.  
  controller的render_exception用来渲染异常页面，它会示例化Mojo::Exception类，然后渲染，同样也不会带上下文信息，所以建议不主动使用.  
  捕获异常: 
</p>


<pre class="src src-perl"><span style="color: #00cdcd; font-weight: bold;">eval</span> {code } <span style="color: #00cdcd; font-weight: bold;">or</span> <span style="color: #00cdcd; font-weight: bold;">do</span> { <span style="color: #00cdcd; font-weight: bold;">die</span> <span style="color: #ffd787;">"xxx"</span> }  
</pre>

</div>

</div>

<div id="outline-container-1-6" class="outline-4">
<h4 id="sec-1-6">helper</h4>
<div class="outline-text-4" id="text-1-6">

<p>  辅助工具，默认的/自带的Mojolicious::Plugin::DefaultHelpers 包含stash,dumper等方法.  
  也可以自己方便地写helper。
</p>
</div>

</div>

<div id="outline-container-1-7" class="outline-4">
<h4 id="sec-1-7">plugin</h4>
<div class="outline-text-4" id="text-1-7">

<p>  插件，许多功能通过插件来添加到Mojo.如Config插件，  
  使用插件：
</p>


<pre class="src src-perl">$self-&gt;app-&gt;plugin(<span style="color: #ffd787;">'Config'</span>,{<span style="color: #ffd787;">file</span> =&gt; <span style="color: #ffd787;">'pesystem.conf'</span>)  
</pre>

</div>

</div>

<div id="outline-container-1-8" class="outline-4">
<h4 id="sec-1-8">hook</h4>
<div class="outline-text-4" id="text-1-8">

<p>  埋点和回调，可以在请求处理和响应的各个阶段进行回调函数的挂入来完成高级自定义。如Exception的处理就是hook来实现的。
</p></div>

</div>

<div id="outline-container-1-9" class="outline-4">
<h4 id="sec-1-9">command 模块</h4>
<div class="outline-text-4" id="text-1-9">

<p>  提供命令行选项功能和启动app的功能。
</p></div>

</div>

<div id="outline-container-1-10" class="outline-4">
<h4 id="sec-1-10">daemon 模块</h4>
<div class="outline-text-4" id="text-1-10">

<p>  实现daemon，继承了command模块。
</p></div>

</div>

<div id="outline-container-1-11" class="outline-4">
<h4 id="sec-1-11">Hypnotoad模块</h4>
<div class="outline-text-4" id="text-1-11">

<p>  实现服务器进程，热部署，websocket支持，非阻塞服务器。
</p></div>

</div>

<div id="outline-container-1-12" class="outline-4">
<h4 id="sec-1-12">websocket</h4>
<div class="outline-text-4" id="text-1-12">

<p>  mojo支持websocket
</p></div>

</div>

<div id="outline-container-1-13" class="outline-4">
<h4 id="sec-1-13">CGI，PSGI</h4>
<div class="outline-text-4" id="text-1-13">

<p>  mojo 支持部署方式为PSGI。
</p></div>

</div>

<div id="outline-container-1-14" class="outline-4">
<h4 id="sec-1-14">Test::Mojo</h4>
<div class="outline-text-4" id="text-1-14">

<p>   测试模块
</p></div>

</div>

<div id="outline-container-1-15" class="outline-4">
<h4 id="sec-1-15">Useragent模块</h4>
<div class="outline-text-4" id="text-1-15">

</div>

</div>

<div id="outline-container-1-16" class="outline-4">
<h4 id="sec-1-16">auto-reboot</h4>
<div class="outline-text-4" id="text-1-16">

<p>   morbo 检测代码变化，，开发环境使用
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Web开发实践</h3>
<div class="outline-text-3" id="text-2">

<ol>
<li>数据库：DBIx::Class
</li>
<li>Form: HTML::FormHandler可以完成很多功能，很强大。 HTML::FormHandler::TraitFor::Model::DBIC实现和数据库关联
</li>
</ol>


</div>
</div>
